package homework;

/**
 * 2023-12-22
 */
public class GuGuDan {

    public static void main(String[] args) {

//        for (int i = 1; i < 4; i++) {
//            for (int j = 1; j <= 9; j++) { // 2-9계산
//                for (int k = 3 * i - 1; k <= 3 * i + 1; k++) { // 단 설정 (i에 의해 3단씩 설정됨)
//                    if (k > 9) { // 10단이상 안나오도록 하기 위함
//                        break;
//                    }
//                    System.out.print(k + "*" + j + "=" + (k * j) + "\t"); // 3단씩 한 줄 출력
//                }
//                System.out.println(); // 세단씩 한 줄 출력 후 줄바꿈
//            }
//            System.out.println(); // 3단의 모든 구구단 출력 후 줄바꿈.
//        }


        for (int i = 1; i < 4; i++) { // 세 문단으로 나뉨.
            for (int j = 1; j <= 9; j++) {
                for (int k = 3 * i - 1; k <= 3 * i + 1; k++) {
                    if (k > 9) {
                        break;
                    }
                    System.out.print(k + "*" + j + "=" + (k * j) + "\t");
                }
                System.out.println();
            }
            System.out.println();
        }

    }
}

/**
 * [문제] 구구단 2 - 9단까지 3개씩 끊어서 출력.
 *
 * [조건]
 * 삼중 for문을 이용.
 *
 * [실행결과]
 * 21=2   31=3   4*1=4
 * 22=4   32=6   4*2=8
 * 23=6   33=9   4*3=12
 * 24=8   34=12  4*4=16
 * 25=10  35=15  4*5=20
 * 26=12  36=18  4*6=24
 * 27=14  37=21  4*7=28
 * 28=16  38=24  4*8=32
 * 29=18  39=27  4*9=36
 *
 * 51=5   61=6   7*1=7
 * 52=10  62=12  7*2=14
 * 53=15  63=18  7*3=21
 * 54=20  64=24  7*4=28
 * 55=25  65=30  7*5=35
 * 56=30  66=36  7*6=42
 * 57=35  67=42  7*7=49
 * 58=40  68=48  7*8=56
 * 59=45  69=54  7*9=63
 *
 * 81=8   91=9
 * 82=16  92=18
 * 83=24  93=27
 * 84=32  94=36
 * 85=40  95=45
 * 86=48  96=54
 * 87=56  97=63
 * 88=64  98=72
 * 89=72  99=81
 */